micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n657xx.h
/*!< Unique device ID register base address */
#define UID_BASE_NS                     (0x46009014UL)

/*!< Revision ID base address */
#define REVID_BASE_NS                   (BOOTROM_BASE_NS + 0x0047ECUL)


#if defined (CPU_IN_SECURE_STATE)
/*********************************************************************/
/*                                                                   */
/* Peripheral and internal SRAMs base addresses - Secure (aliased_S) */
/*                                                                   */
/*********************************************************************/
#define ITCM_BASE_S                     0x10000000UL /*!< Base address of ITCM from 64 KB up to 256 KB               */
#define BOOTROM_BASE_S                  0x18000000UL /*!< Base address of 128 KB boot ROM accessible over AXI        */
#define DTCM_BASE_S                     0x30000000UL /*!< Base address of DTCM from 128 KB up to 256 KB              */
#define SRAM1_AXI_BASE_S                0x34000000UL /*!< Base address of up to 1 MB system RAM 1 accessible over AXI */
#define SRAM2_AXI_BASE_S                0x34100000UL /*!< Base address of 1 MB system RAM 2 accessible over AXI      */
#define SRAM3_AXI_BASE_S                0x34200000UL /*!< Base address of 448 KB system RAM 3 accessible over AXI      */
#define SRAM4_AXI_BASE_S                0x34270000UL /*!< Base address of 448 KB system RAM 4 accessible over AXI */
#define SRAM5_AXI_BASE_S                0x342E0000UL /*!< Base address of 448 KB system RAM 5 accessible over AXI */
#define SRAM6_AXI_BASE_S                0x34350000UL /*!< Base address of 448 KB system RAM 6 accessible over AXI */
#define SRAM_AXI_BASE_S                 SRAM1_AXI_BASE_NS /*!< Base address of 3.792 MB system RAM accessible over AXI */
#define CACHEAXI_RAM_BASE_S             0x343C0000UL /*!< Base address of 256 KB NPU Cache RAM accessible over AXI   */
#define VENC_RAM_BASE_S                 0x34400000UL /*!< Base address of 128 KB of Video Encoder RAM accessible over AXI */
#define GFXMMU_VIRTUAL_BUFFER0_BASE_S   0x35000000UL /*!< Base address of 4 MB GFXMMU virtual buffer 0               */
#define GFXMMU_VIRTUAL_BUFFER1_BASE_S   0x35400000UL /*!< Base address of 4 MB GFXMMU virtual buffer 1               */
#define GFXMMU_VIRTUAL_BUFFER2_BASE_S   0x35800000UL /*!< Base address of 4 MB GFXMMU virtual buffer 2               */
#define GFXMMU_VIRTUAL_BUFFER3_BASE_S   0x35C00000UL /*!< Base address of 4 MB GFXMMU virtual buffer 3               */
#define STM500_CHANNELS_BASE_S          0x37F00000UL /*!< Base address of 1 MB of STM500 Channels (System Trace)     */
#define SRAM1_AHB_BASE_S                0x38000000UL /*!< Base address of 16 KB system RAM 1 over AXI->AHB Bridge    */
#define SRAM2_AHB_BASE_S                0x38004000UL /*!< Base address of 16 KB system RAM 2 over AXI->AHB Bridge    */
#define SRAM_AHB_BASE_S                 SRAM1_AHB_BASE_S /*!< Base address of 32 KB system RAM over AXI->AHB Bridge  */
#define BKPSRAM_BASE_S                  0x3C000000UL   /*!< Base address of 8 KB Backup SRAM over AXI->AHB Bridge    */
#define PERIPH_BASE_S                   0x50000000UL   /*!< Base address of : AHB/APB Peripherals                    */

/*!< Peripheral memory map */
#define APB1PERIPH_BASE_S               PERIPH_BASE_S
#define AHB1PERIPH_BASE_S               (PERIPH_BASE_S + 0x00020000UL)
#define APB2PERIPH_BASE_S               (PERIPH_BASE_S + 0x02000000UL)
#define AHB2PERIPH_BASE_S               (PERIPH_BASE_S + 0x02020000UL)
#define APB3PERIPH_BASE_S               (PERIPH_BASE_S + 0x04000000UL)
#define AHB3PERIPH_BASE_S               (PERIPH_BASE_S + 0x04020000UL)
#define APB4PERIPH_BASE_S               (PERIPH_BASE_S + 0x06000000UL)
#define AHB4PERIPH_BASE_S               (PERIPH_BASE_S + 0x06020000UL)
#define APB5PERIPH_BASE_S               (PERIPH_BASE_S + 0x08000000UL)
#define AHB5PERIPH_BASE_S               (PERIPH_BASE_S + 0x08020000UL)

/*!< APB1 peripherals */
#define TIM2_BASE_S                     (APB1PERIPH_BASE_S + 0x0000UL)
#define TIM3_BASE_S                     (APB1PERIPH_BASE_S + 0x0400UL)
#define TIM4_BASE_S                     (APB1PERIPH_BASE_S + 0x0800UL)
#define TIM5_BASE_S                     (APB1PERIPH_BASE_S + 0x0C00UL)
#define TIM6_BASE_S                     (APB1PERIPH_BASE_S + 0x1000UL)
#define TIM7_BASE_S                     (APB1PERIPH_BASE_S + 0x1400UL)
#define TIM12_BASE_S                    (APB1PERIPH_BASE_S + 0x1800UL)
#define TIM13_BASE_S                    (APB1PERIPH_BASE_S + 0x1C00UL)
#define TIM14_BASE_S                    (APB1PERIPH_BASE_S + 0x2000UL)
#define LPTIM1_BASE_S                   (APB1PERIPH_BASE_S + 0x2400UL)
#define WWDG_BASE_S                     (APB1PERIPH_BASE_S + 0x2C00UL)
#define TIM10_BASE_S                    (APB1PERIPH_BASE_S + 0x3000UL)
#define TIM11_BASE_S                    (APB1PERIPH_BASE_S + 0x3400UL)
#define SPI2_BASE_S                     (APB1PERIPH_BASE_S + 0x3800UL)
#define SPI3_BASE_S                     (APB1PERIPH_BASE_S + 0x3C00UL)
#define SPDIFRX_BASE_S                  (APB1PERIPH_BASE_S + 0x4000UL)
#define USART2_BASE_S                   (APB1PERIPH_BASE_S + 0x4400UL)
#define USART3_BASE_S                   (APB1PERIPH_BASE_S + 0x4800UL)
#define UART4_BASE_S                    (APB1PERIPH_BASE_S + 0x4C00UL)
#define UART5_BASE_S                    (APB1PERIPH_BASE_S + 0x5000UL)
#define I2C1_BASE_S                     (APB1PERIPH_BASE_S + 0x5400UL)
#define I2C2_BASE_S                     (APB1PERIPH_BASE_S + 0x5800UL)
#define I2C3_BASE_S                     (APB1PERIPH_BASE_S + 0x5C00UL)
#define I3C1_BASE_S                     (APB1PERIPH_BASE_S + 0x6000UL)
#define I3C2_BASE_S                     (APB1PERIPH_BASE_S + 0x6400UL)
#define UART7_BASE_S                    (APB1PERIPH_BASE_S + 0x7800UL)
#define UART8_BASE_S                    (APB1PERIPH_BASE_S + 0x7C00UL)
#define MDIOS_BASE_S                    (APB1PERIPH_BASE_S + 0x9400UL)
#define FDCAN1_BASE_S                   (APB1PERIPH_BASE_S + 0xA000UL)
#define FDCAN2_BASE_S                   (APB1PERIPH_BASE_S + 0xA400UL)
#define FDCAN_CCU_BASE_S                (APB1PERIPH_BASE_S + 0xA800UL)
#define SRAMCAN_BASE_S                  (APB1PERIPH_BASE_S + 0xC000UL)
#define FDCAN3_BASE_S                   (APB1PERIPH_BASE_S + 0xE800UL)
#define UCPD1_BASE_S                    (APB1PERIPH_BASE_S + 0xFC00UL)

/*!< AHB1 peripherals */
#define GPDMA1_BASE_S                   (AHB1PERIPH_BASE_S + 0x1000UL)
#define GPDMA1_Channel0_BASE_S          (GPDMA1_BASE_S + 0x0050UL)
#define GPDMA1_Channel1_BASE_S          (GPDMA1_BASE_S + 0x00D0UL)
#define GPDMA1_Channel2_BASE_S          (GPDMA1_BASE_S + 0x0150UL)
#define GPDMA1_Channel3_BASE_S          (GPDMA1_BASE_S + 0x01D0UL)
#define GPDMA1_Channel4_BASE_S          (GPDMA1_BASE_S + 0x0250UL)
#define GPDMA1_Channel5_BASE_S          (GPDMA1_BASE_S + 0x02D0UL)
#define GPDMA1_Channel6_BASE_S          (GPDMA1_BASE_S + 0x0350UL)
#define GPDMA1_Channel7_BASE_S          (GPDMA1_BASE_S + 0x03D0UL)
#define GPDMA1_Channel8_BASE_S          (GPDMA1_BASE_S + 0x0450UL)
#define GPDMA1_Channel9_BASE_S          (GPDMA1_BASE_S + 0x04D0UL)
#define GPDMA1_Channel10_BASE_S         (GPDMA1_BASE_S + 0x0550UL)
#define GPDMA1_Channel11_BASE_S         (GPDMA1_BASE_S + 0x05D0UL)
#define GPDMA1_Channel12_BASE_S         (GPDMA1_BASE_S + 0x0650UL)
#define GPDMA1_Channel13_BASE_S         (GPDMA1_BASE_S + 0x06D0UL)
#define GPDMA1_Channel14_BASE_S         (GPDMA1_BASE_S + 0x0750UL)
#define GPDMA1_Channel15_BASE_S         (GPDMA1_BASE_S + 0x07D0UL)
#define ADC1_BASE_S                     (AHB1PERIPH_BASE_S + 0x2000UL)
#define ADC2_BASE_S                     (AHB1PERIPH_BASE_S + 0x2100UL)
#define ADC12_COMMON_BASE_S             (AHB1PERIPH_BASE_S + 0x2300UL)

/*!< APB2 peripherals */
#define TIM1_BASE_S                     (APB2PERIPH_BASE_S + 0x0000UL)
#define TIM8_BASE_S                     (APB2PERIPH_BASE_S + 0x0400UL)
#define USART1_BASE_S                   (APB2PERIPH_BASE_S + 0x1000UL)
#define USART6_BASE_S                   (APB2PERIPH_BASE_S + 0x1400UL)
#define UART9_BASE_S                    (APB2PERIPH_BASE_S + 0x1800UL)
#define USART10_BASE_S                  (APB2PERIPH_BASE_S + 0x1C00UL)
#define SPI1_BASE_S                     (APB2PERIPH_BASE_S + 0x3000UL)
#define SPI4_BASE_S                     (APB2PERIPH_BASE_S + 0x3400UL)
#define TIM18_BASE_S                    (APB2PERIPH_BASE_S + 0x3C00UL)
#define TIM15_BASE_S                    (APB2PERIPH_BASE_S + 0x4000UL)
#define TIM16_BASE_S                    (APB2PERIPH_BASE_S + 0x4400UL)
#define TIM17_BASE_S                    (APB2PERIPH_BASE_S + 0x4800UL)
#define TIM9_BASE_S                     (APB2PERIPH_BASE_S + 0x4C00UL)
#define SPI5_BASE_S                     (APB2PERIPH_BASE_S + 0x5000UL)
#define SAI1_BASE_S                     (APB2PERIPH_BASE_S + 0x5800UL)
#define SAI1_Block_A_BASE_S             (SAI1_BASE_S + 0x0004UL)
#define SAI1_Block_B_BASE_S             (SAI1_BASE_S + 0x0024UL)
#define SAI2_BASE_S                     (APB2PERIPH_BASE_S + 0x5C00UL)
#define SAI2_Block_A_BASE_S             (SAI2_BASE_S + 0x0004UL)
#define SAI2_Block_B_BASE_S             (SAI2_BASE_S + 0x0024UL)

/*!< AHB2 peripherals */
#define RAMCFG_BASE_S                   (AHB2PERIPH_BASE_S + 0x3000UL)
#define RAMCFG_SRAM1_AXI_BASE_S         (RAMCFG_BASE_S)
#define RAMCFG_SRAM2_AXI_BASE_S         (RAMCFG_BASE_S + 0x0080UL)
#define RAMCFG_SRAM3_AXI_BASE_S         (RAMCFG_BASE_S + 0x0100UL)
#define RAMCFG_SRAM4_AXI_BASE_S         (RAMCFG_BASE_S + 0x0180UL)
#define RAMCFG_SRAM5_AXI_BASE_S         (RAMCFG_BASE_S + 0x0200UL)
#define RAMCFG_SRAM6_AXI_BASE_S         (RAMCFG_BASE_S + 0x0280UL)
#define RAMCFG_SRAM1_AHB_BASE_S         (RAMCFG_BASE_S + 0x0300UL)
#define RAMCFG_SRAM2_AHB_BASE_S         (RAMCFG_BASE_S + 0x0380UL)
#define RAMCFG_VENC_RAM_BASE_S          (RAMCFG_BASE_S + 0x0400UL)
#define RAMCFG_BKPSRAM_BASE_S           (RAMCFG_BASE_S + 0x0480UL)
#define RAMCFG_FLEXRAM_BASE_S           (RAMCFG_BASE_S + 0x0500UL)
#define MDF1_BASE_S                     (AHB2PERIPH_BASE_S + 0x5000UL)
#define MDF1_Filter0_BASE_S             (MDF1_BASE_S + 0x0080UL)
#define MDF1_Filter1_BASE_S             (MDF1_BASE_S + 0x0100UL)
#define MDF1_Filter2_BASE_S             (MDF1_BASE_S + 0x0180UL)
#define MDF1_Filter3_BASE_S             (MDF1_BASE_S + 0x0200UL)
#define MDF1_Filter4_BASE_S             (MDF1_BASE_S + 0x0280UL)
#define MDF1_Filter5_BASE_S             (MDF1_BASE_S + 0x0300UL)
#define ADF1_BASE_S                     (AHB2PERIPH_BASE_S + 0x6000UL)
#define ADF1_Filter0_BASE_S             (ADF1_BASE_S + 0x0080UL)

/*!< APB3 peripherals */
#define DAP_ROM_BASE_S                  (APB3PERIPH_BASE_S + 0x0000UL)
#define DBGMCU_BASE_S                   (APB3PERIPH_BASE_S + 0x1000UL)
#define DFT_APB_BASE_S                  (APB3PERIPH_BASE_S + 0x2000UL)

/*!< AHB3 peripherals */
#define RNG_BASE_S                      (AHB3PERIPH_BASE_S + 0x0000UL)
#define HASH_BASE_S                     (AHB3PERIPH_BASE_S + 0x0400UL)
#define HASH_DIGEST_BASE_S              (AHB3PERIPH_BASE_S + 0x0710UL)
#define CRYP_BASE_S                     (AHB3PERIPH_BASE_S + 0x0800UL)
#define SAES_BASE_S                     (AHB3PERIPH_BASE_S + 0x1000UL)
#define PKA_BASE_S                      (AHB3PERIPH_BASE_S + 0x2000UL)
#define RIFSC_BASE_S                    (AHB3PERIPH_BASE_S + 0x4000UL)
#define IAC_BASE_S                      (AHB3PERIPH_BASE_S + 0x5000UL)
#define RISAF1_BASE_S                   (AHB3PERIPH_BASE_S + 0x6000UL)
#define RISAF2_BASE_S                   (AHB3PERIPH_BASE_S + 0x7000UL)
#define RISAF3_BASE_S                   (AHB3PERIPH_BASE_S + 0x8000UL)
#define RISAF4_BASE_S                   (AHB3PERIPH_BASE_S + 0x9000UL)
#define RISAF5_BASE_S                   (AHB3PERIPH_BASE_S + 0xA000UL)
#define RISAF6_BASE_S                   (AHB3PERIPH_BASE_S + 0xB000UL)
#define RISAF7_BASE_S                   (AHB3PERIPH_BASE_S + 0xC000UL)
#define RISAF8_BASE_S                   (AHB3PERIPH_BASE_S + 0xD000UL)
#define RISAF9_BASE_S                   (AHB3PERIPH_BASE_S + 0xE000UL)
#define RISAF11_BASE_S                  (AHB3PERIPH_BASE_S + 0x010000UL)
#define RISAF12_BASE_S                  (AHB3PERIPH_BASE_S + 0x011000UL)
#define RISAF13_BASE_S                  (AHB3PERIPH_BASE_S + 0x012000UL)
#define RISAF14_BASE_S                  (AHB3PERIPH_BASE_S + 0x013000UL)
#define RISAF15_BASE_S                  (AHB3PERIPH_BASE_S + 0x014000UL)
#define RISAF21_BASE_S                  (AHB3PERIPH_BASE_S + 0x015000UL)
#define RISAF22_BASE_S                  (AHB3PERIPH_BASE_S + 0x016000UL)
#define RISAF23_BASE_S                  (AHB3PERIPH_BASE_S + 0x017000UL)

/*!< APB4 peripherals */
#define HDP_BASE_S                      (APB4PERIPH_BASE_S + 0x0800UL)
#define LPUART1_BASE_S                  (APB4PERIPH_BASE_S + 0x0C00UL)
#define SPI6_BASE_S                     (APB4PERIPH_BASE_S + 0x1400UL)
#define I2C4_BASE_S                     (APB4PERIPH_BASE_S + 0x1C00UL)
#define LPTIM2_BASE_S                   (APB4PERIPH_BASE_S + 0x2400UL)
#define LPTIM3_BASE_S                   (APB4PERIPH_BASE_S + 0x2800UL)
#define LPTIM4_BASE_S                   (APB4PERIPH_BASE_S + 0x2C00UL)
#define LPTIM5_BASE_S                   (APB4PERIPH_BASE_S + 0x3000UL)
#define VREFBUF_BASE_S                  (APB4PERIPH_BASE_S + 0x3C00UL)
#define RTC_BASE_S                      (APB4PERIPH_BASE_S + 0x4000UL)
#define TAMP_BASE_S                     (APB4PERIPH_BASE_S + 0x4400UL)
#define IWDG_BASE_S                     (APB4PERIPH_BASE_S + 0x4800UL)

