micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n657xx.h
/*******************  Bits definition for IAC_ISR2 register *******************/
#define IAC_ISR2_IAF64_Pos            (0U)
#define IAC_ISR2_IAF64_Msk            (0x1UL << IAC_ISR2_IAF64_Pos)              /*!< 0x00000001 */
#define IAC_ISR2_IAF64                IAC_ISR2_IAF64_Msk
#define IAC_ISR2_IAF65_Pos            (1U)
#define IAC_ISR2_IAF65_Msk            (0x1UL << IAC_ISR2_IAF65_Pos)              /*!< 0x00000002 */
#define IAC_ISR2_IAF65                IAC_ISR2_IAF65_Msk
#define IAC_ISR2_IAF67_Pos            (3U)
#define IAC_ISR2_IAF67_Msk            (0x1UL << IAC_ISR2_IAF67_Pos)              /*!< 0x00000008 */
#define IAC_ISR2_IAF67                IAC_ISR2_IAF67_Msk
#define IAC_ISR2_IAF68_Pos            (4U)
#define IAC_ISR2_IAF68_Msk            (0x1UL << IAC_ISR2_IAF68_Pos)              /*!< 0x00000010 */
#define IAC_ISR2_IAF68                IAC_ISR2_IAF68_Msk
#define IAC_ISR2_IAF69_Pos            (5U)
#define IAC_ISR2_IAF69_Msk            (0x1UL << IAC_ISR2_IAF69_Pos)              /*!< 0x00000020 */
#define IAC_ISR2_IAF69                IAC_ISR2_IAF69_Msk
#define IAC_ISR2_IAF76_Pos            (12U)
#define IAC_ISR2_IAF76_Msk            (0x1UL << IAC_ISR2_IAF76_Pos)              /*!< 0x00001000 */
#define IAC_ISR2_IAF76                IAC_ISR2_IAF76_Msk
#define IAC_ISR2_IAF77_Pos            (13U)
#define IAC_ISR2_IAF77_Msk            (0x1UL << IAC_ISR2_IAF77_Pos)              /*!< 0x00002000 */
#define IAC_ISR2_IAF77                IAC_ISR2_IAF77_Msk
#define IAC_ISR2_IAF78_Pos            (14U)
#define IAC_ISR2_IAF78_Msk            (0x1UL << IAC_ISR2_IAF78_Pos)              /*!< 0x00004000 */
#define IAC_ISR2_IAF78                IAC_ISR2_IAF78_Msk
#define IAC_ISR2_IAF79_Pos            (15U)
#define IAC_ISR2_IAF79_Msk            (0x1UL << IAC_ISR2_IAF79_Pos)              /*!< 0x00008000 */
#define IAC_ISR2_IAF79                IAC_ISR2_IAF79_Msk
#define IAC_ISR2_IAF80_Pos            (16U)
#define IAC_ISR2_IAF80_Msk            (0x1UL << IAC_ISR2_IAF80_Pos)              /*!< 0x00010000 */
#define IAC_ISR2_IAF80                IAC_ISR2_IAF80_Msk
#define IAC_ISR2_IAF81_Pos            (17U)
#define IAC_ISR2_IAF81_Msk            (0x1UL << IAC_ISR2_IAF81_Pos)              /*!< 0x00020000 */
#define IAC_ISR2_IAF81                IAC_ISR2_IAF81_Msk
#define IAC_ISR2_IAF82_Pos            (18U)
#define IAC_ISR2_IAF82_Msk            (0x1UL << IAC_ISR2_IAF82_Pos)              /*!< 0x00040000 */
#define IAC_ISR2_IAF82                IAC_ISR2_IAF82_Msk
#define IAC_ISR2_IAF83_Pos            (19U)
#define IAC_ISR2_IAF83_Msk            (0x1UL << IAC_ISR2_IAF83_Pos)              /*!< 0x00080000 */
#define IAC_ISR2_IAF83                IAC_ISR2_IAF83_Msk
#define IAC_ISR2_IAF84_Pos            (20U)
#define IAC_ISR2_IAF84_Msk            (0x1UL << IAC_ISR2_IAF84_Pos)              /*!< 0x00100000 */
#define IAC_ISR2_IAF84                IAC_ISR2_IAF84_Msk
#define IAC_ISR2_IAF86_Pos            (22U)
#define IAC_ISR2_IAF86_Msk            (0x1UL << IAC_ISR2_IAF86_Pos)              /*!< 0x00400000 */
#define IAC_ISR2_IAF86                IAC_ISR2_IAF86_Msk
#define IAC_ISR2_IAF87_Pos            (23U)
#define IAC_ISR2_IAF87_Msk            (0x1UL << IAC_ISR2_IAF87_Pos)              /*!< 0x00800000 */
#define IAC_ISR2_IAF87                IAC_ISR2_IAF87_Msk
#define IAC_ISR2_IAF88_Pos            (24U)
#define IAC_ISR2_IAF88_Msk            (0x1UL << IAC_ISR2_IAF88_Pos)              /*!< 0x01000000 */
#define IAC_ISR2_IAF88                IAC_ISR2_IAF88_Msk
#define IAC_ISR2_IAF89_Pos            (25U)
#define IAC_ISR2_IAF89_Msk            (0x1UL << IAC_ISR2_IAF89_Pos)              /*!< 0x02000000 */
#define IAC_ISR2_IAF89                IAC_ISR2_IAF89_Msk
#define IAC_ISR2_IAF90_Pos            (26U)
#define IAC_ISR2_IAF90_Msk            (0x1UL << IAC_ISR2_IAF90_Pos)              /*!< 0x04000000 */
#define IAC_ISR2_IAF90                IAC_ISR2_IAF90_Msk
#define IAC_ISR2_IAF92_Pos            (28U)
#define IAC_ISR2_IAF92_Msk            (0x1UL << IAC_ISR2_IAF92_Pos)              /*!< 0x10000000 */
#define IAC_ISR2_IAF92                IAC_ISR2_IAF92_Msk
#define IAC_ISR2_IAF93_Pos            (29U)
#define IAC_ISR2_IAF93_Msk            (0x1UL << IAC_ISR2_IAF93_Pos)              /*!< 0x20000000 */
#define IAC_ISR2_IAF93                IAC_ISR2_IAF93_Msk
#define IAC_ISR2_IAF94_Pos            (30U)
#define IAC_ISR2_IAF94_Msk            (0x1UL << IAC_ISR2_IAF94_Pos)              /*!< 0x40000000 */
#define IAC_ISR2_IAF94                IAC_ISR2_IAF94_Msk
#define IAC_ISR2_IAF95_Pos            (31U)
#define IAC_ISR2_IAF95_Msk            (0x1UL << IAC_ISR2_IAF95_Pos)              /*!< 0x80000000 */
#define IAC_ISR2_IAF95                IAC_ISR2_IAF95_Msk

/*******************  Bits definition for IAC_ISR3 register *******************/
#define IAC_ISR3_IAF96_Pos            (0U)
#define IAC_ISR3_IAF96_Msk            (0x1UL << IAC_ISR3_IAF96_Pos)              /*!< 0x00000001 */
#define IAC_ISR3_IAF96                IAC_ISR3_IAF96_Msk
#define IAC_ISR3_IAF97_Pos            (1U)
#define IAC_ISR3_IAF97_Msk            (0x1UL << IAC_ISR3_IAF97_Pos)              /*!< 0x00000002 */
#define IAC_ISR3_IAF97                IAC_ISR3_IAF97_Msk
#define IAC_ISR3_IAF98_Pos            (2U)
#define IAC_ISR3_IAF98_Msk            (0x1UL << IAC_ISR3_IAF98_Pos)              /*!< 0x00000004 */
#define IAC_ISR3_IAF98                IAC_ISR3_IAF98_Msk
#define IAC_ISR3_IAF99_Pos            (3U)
#define IAC_ISR3_IAF99_Msk            (0x1UL << IAC_ISR3_IAF99_Pos)              /*!< 0x00000008 */
#define IAC_ISR3_IAF99                IAC_ISR3_IAF99_Msk
#define IAC_ISR3_IAF100_Pos           (4U)
#define IAC_ISR3_IAF100_Msk           (0x1UL << IAC_ISR3_IAF100_Pos)             /*!< 0x00000010 */
#define IAC_ISR3_IAF100               IAC_ISR3_IAF100_Msk
#define IAC_ISR3_IAF101_Pos           (5U)
#define IAC_ISR3_IAF101_Msk           (0x1UL << IAC_ISR3_IAF101_Pos)             /*!< 0x00000020 */
#define IAC_ISR3_IAF101               IAC_ISR3_IAF101_Msk
#define IAC_ISR3_IAF102_Pos           (6U)
#define IAC_ISR3_IAF102_Msk           (0x1UL << IAC_ISR3_IAF102_Pos)             /*!< 0x00000040 */
#define IAC_ISR3_IAF102               IAC_ISR3_IAF102_Msk
#define IAC_ISR3_IAF103_Pos           (7U)
#define IAC_ISR3_IAF103_Msk           (0x1UL << IAC_ISR3_IAF103_Pos)             /*!< 0x00000080 */
#define IAC_ISR3_IAF103               IAC_ISR3_IAF103_Msk
#define IAC_ISR3_IAF104_Pos           (8U)
#define IAC_ISR3_IAF104_Msk           (0x1UL << IAC_ISR3_IAF104_Pos)             /*!< 0x00000100 */
#define IAC_ISR3_IAF104               IAC_ISR3_IAF104_Msk
#define IAC_ISR3_IAF106_Pos           (10U)
#define IAC_ISR3_IAF106_Msk           (0x1UL << IAC_ISR3_IAF106_Pos)             /*!< 0x00000400 */
#define IAC_ISR3_IAF106               IAC_ISR3_IAF106_Msk

/*******************  Bits definition for IAC_ISR4 register *******************/
#define IAC_ISR4_IAF128_Pos           (0U)
#define IAC_ISR4_IAF128_Msk           (0x1UL << IAC_ISR4_IAF128_Pos)             /*!< 0x00000001 */
#define IAC_ISR4_IAF128               IAC_ISR4_IAF128_Msk
#define IAC_ISR4_IAF129_Pos           (1U)
#define IAC_ISR4_IAF129_Msk           (0x1UL << IAC_ISR4_IAF129_Pos)             /*!< 0x00000002 */
#define IAC_ISR4_IAF129               IAC_ISR4_IAF129_Msk
#define IAC_ISR4_IAF130_Pos           (2U)
#define IAC_ISR4_IAF130_Msk           (0x1UL << IAC_ISR4_IAF130_Pos)             /*!< 0x00000004 */
#define IAC_ISR4_IAF130               IAC_ISR4_IAF130_Msk
#define IAC_ISR4_IAF131_Pos           (3U)
#define IAC_ISR4_IAF131_Msk           (0x1UL << IAC_ISR4_IAF131_Pos)             /*!< 0x00000008 */
#define IAC_ISR4_IAF131               IAC_ISR4_IAF131_Msk
#define IAC_ISR4_IAF133_Pos           (5U)
#define IAC_ISR4_IAF133_Msk           (0x1UL << IAC_ISR4_IAF133_Pos)             /*!< 0x00000020 */
#define IAC_ISR4_IAF133               IAC_ISR4_IAF133_Msk
#define IAC_ISR4_IAF134_Pos           (6U)
#define IAC_ISR4_IAF134_Msk           (0x1UL << IAC_ISR4_IAF134_Pos)             /*!< 0x00000040 */
#define IAC_ISR4_IAF134               IAC_ISR4_IAF134_Msk
#define IAC_ISR4_IAF135_Pos           (7U)
#define IAC_ISR4_IAF135_Msk           (0x1UL << IAC_ISR4_IAF135_Pos)             /*!< 0x00000080 */
#define IAC_ISR4_IAF135               IAC_ISR4_IAF135_Msk
#define IAC_ISR4_IAF136_Pos           (8U)
#define IAC_ISR4_IAF136_Msk           (0x1UL << IAC_ISR4_IAF136_Pos)             /*!< 0x00000100 */
#define IAC_ISR4_IAF136               IAC_ISR4_IAF136_Msk
#define IAC_ISR4_IAF137_Pos           (9U)
#define IAC_ISR4_IAF137_Msk           (0x1UL << IAC_ISR4_IAF137_Pos)             /*!< 0x00000200 */
#define IAC_ISR4_IAF137               IAC_ISR4_IAF137_Msk
#define IAC_ISR4_IAF138_Pos           (10U)
#define IAC_ISR4_IAF138_Msk           (0x1UL << IAC_ISR4_IAF138_Pos)             /*!< 0x00000400 */
#define IAC_ISR4_IAF138               IAC_ISR4_IAF138_Msk
#define IAC_ISR4_IAF139_Pos           (11U)
#define IAC_ISR4_IAF139_Msk           (0x1UL << IAC_ISR4_IAF139_Pos)             /*!< 0x00000800 */
#define IAC_ISR4_IAF139               IAC_ISR4_IAF139_Msk
#define IAC_ISR4_IAF140_Pos           (12U)
#define IAC_ISR4_IAF140_Msk           (0x1UL << IAC_ISR4_IAF140_Pos)             /*!< 0x00001000 */
#define IAC_ISR4_IAF140               IAC_ISR4_IAF140_Msk
#define IAC_ISR4_IAF141_Pos           (13U)
#define IAC_ISR4_IAF141_Msk           (0x1UL << IAC_ISR4_IAF141_Pos)             /*!< 0x00002000 */
#define IAC_ISR4_IAF141               IAC_ISR4_IAF141_Msk
#define IAC_ISR4_IAF142_Pos           (14U)
#define IAC_ISR4_IAF142_Msk           (0x1UL << IAC_ISR4_IAF142_Pos)             /*!< 0x00004000 */
#define IAC_ISR4_IAF142               IAC_ISR4_IAF142_Msk
#define IAC_ISR4_IAF143_Pos           (15U)
#define IAC_ISR4_IAF143_Msk           (0x1UL << IAC_ISR4_IAF143_Pos)             /*!< 0x00008000 */
#define IAC_ISR4_IAF143               IAC_ISR4_IAF143_Msk
#define IAC_ISR4_IAF144_Pos           (16U)
#define IAC_ISR4_IAF144_Msk           (0x1UL << IAC_ISR4_IAF144_Pos)             /*!< 0x00010000 */
#define IAC_ISR4_IAF144               IAC_ISR4_IAF144_Msk
#define IAC_ISR4_IAF145_Pos           (17U)
#define IAC_ISR4_IAF145_Msk           (0x1UL << IAC_ISR4_IAF145_Pos)             /*!< 0x00020000 */
#define IAC_ISR4_IAF145               IAC_ISR4_IAF145_Msk
#define IAC_ISR4_IAF146_Pos           (18U)
#define IAC_ISR4_IAF146_Msk           (0x1UL << IAC_ISR4_IAF146_Pos)             /*!< 0x00040000 */
#define IAC_ISR4_IAF146               IAC_ISR4_IAF146_Msk
#define IAC_ISR4_IAF147_Pos           (19U)
#define IAC_ISR4_IAF147_Msk           (0x1UL << IAC_ISR4_IAF147_Pos)             /*!< 0x00080000 */
#define IAC_ISR4_IAF147               IAC_ISR4_IAF147_Msk
#define IAC_ISR4_IAF149_Pos           (21U)
#define IAC_ISR4_IAF149_Msk           (0x1UL << IAC_ISR4_IAF149_Pos)             /*!< 0x00200000 */
#define IAC_ISR4_IAF149               IAC_ISR4_IAF149_Msk
#define IAC_ISR4_IAF150_Pos           (22U)
#define IAC_ISR4_IAF150_Msk           (0x1UL << IAC_ISR4_IAF150_Pos)             /*!< 0x00400000 */
#define IAC_ISR4_IAF150               IAC_ISR4_IAF150_Msk
#define IAC_ISR4_IAF151_Pos           (23U)
#define IAC_ISR4_IAF151_Msk           (0x1UL << IAC_ISR4_IAF151_Pos)             /*!< 0x00800000 */
#define IAC_ISR4_IAF151               IAC_ISR4_IAF151_Msk
#define IAC_ISR4_IAF152_Pos           (24U)
#define IAC_ISR4_IAF152_Msk           (0x1UL << IAC_ISR4_IAF152_Pos)             /*!< 0x01000000 */
#define IAC_ISR4_IAF152               IAC_ISR4_IAF152_Msk
#define IAC_ISR4_IAF153_Pos           (25U)
#define IAC_ISR4_IAF153_Msk           (0x1UL << IAC_ISR4_IAF153_Pos)             /*!< 0x02000000 */
#define IAC_ISR4_IAF153               IAC_ISR4_IAF153_Msk
#define IAC_ISR4_IAF155_Pos           (27U)
#define IAC_ISR4_IAF155_Msk           (0x1UL << IAC_ISR4_IAF155_Pos)             /*!< 0x08000000 */
#define IAC_ISR4_IAF155               IAC_ISR4_IAF155_Msk
#define IAC_ISR4_IAF156_Pos           (28U)
#define IAC_ISR4_IAF156_Msk           (0x1UL << IAC_ISR4_IAF156_Pos)             /*!< 0x10000000 */
#define IAC_ISR4_IAF156               IAC_ISR4_IAF156_Msk
#define IAC_ISR4_IAF157_Pos           (29U)
#define IAC_ISR4_IAF157_Msk           (0x1UL << IAC_ISR4_IAF157_Pos)             /*!< 0x20000000 */
#define IAC_ISR4_IAF157               IAC_ISR4_IAF157_Msk

/*******************  Bits definition for IAC_ICR0 register *******************/
#define IAC_ICR0_IACF0_Pos            (0U)
#define IAC_ICR0_IACF0_Msk            (0x1UL << IAC_ICR0_IACF0_Pos)               /*!< 0x00000001 */
#define IAC_ICR0_IACF0                IAC_ICR0_IACF0_Msk
#define IAC_ICR0_IACF1_Pos            (1U)
#define IAC_ICR0_IACF1_Msk            (0x1UL << IAC_ICR0_IACF1_Pos)               /*!< 0x00000002 */
#define IAC_ICR0_IACF1                IAC_ICR0_IACF1_Msk
#define IAC_ICR0_IACF2_Pos            (2U)
#define IAC_ICR0_IACF2_Msk            (0x1UL << IAC_ICR0_IACF2_Pos)               /*!< 0x00000004 */
#define IAC_ICR0_IACF2                IAC_ICR0_IACF2_Msk
#define IAC_ICR0_IACF3_Pos            (3U)
#define IAC_ICR0_IACF3_Msk            (0x1UL << IAC_ICR0_IACF3_Pos)               /*!< 0x00000008 */
#define IAC_ICR0_IACF3                IAC_ICR0_IACF3_Msk
#define IAC_ICR0_IACF4_Pos            (4U)
#define IAC_ICR0_IACF4_Msk            (0x1UL << IAC_ICR0_IACF4_Pos)               /*!< 0x00000010 */
#define IAC_ICR0_IACF4                IAC_ICR0_IACF4_Msk
#define IAC_ICR0_IACF5_Pos            (5U)
#define IAC_ICR0_IACF5_Msk            (0x1UL << IAC_ICR0_IACF5_Pos)               /*!< 0x00000020 */
#define IAC_ICR0_IACF5                IAC_ICR0_IACF5_Msk
#define IAC_ICR0_IACF6_Pos            (6U)
#define IAC_ICR0_IACF6_Msk            (0x1UL << IAC_ICR0_IACF6_Pos)               /*!< 0x00000040 */
#define IAC_ICR0_IACF6                IAC_ICR0_IACF6_Msk
#define IAC_ICR0_IACF8_Pos            (8U)
#define IAC_ICR0_IACF8_Msk            (0x1UL << IAC_ICR0_IACF8_Pos)               /*!< 0x00000100 */
#define IAC_ICR0_IACF8                IAC_ICR0_IACF8_Msk
#define IAC_ICR0_IACF9_Pos            (9U)
#define IAC_ICR0_IACF9_Msk            (0x1UL << IAC_ICR0_IACF9_Pos)               /*!< 0x00000200 */
#define IAC_ICR0_IACF9                IAC_ICR0_IACF9_Msk
#define IAC_ICR0_IACF10_Pos           (10U)
#define IAC_ICR0_IACF10_Msk           (0x1UL << IAC_ICR0_IACF10_Pos)              /*!< 0x00000400 */
#define IAC_ICR0_IACF10               IAC_ICR0_IACF10_Msk
#define IAC_ICR0_IACF11_Pos           (11U)
#define IAC_ICR0_IACF11_Msk           (0x1UL << IAC_ICR0_IACF11_Pos)              /*!< 0x00000800 */
#define IAC_ICR0_IACF11               IAC_ICR0_IACF11_Msk
#define IAC_ICR0_IACF12_Pos           (12U)
#define IAC_ICR0_IACF12_Msk           (0x1UL << IAC_ICR0_IACF12_Pos)              /*!< 0x00001000 */
#define IAC_ICR0_IACF12               IAC_ICR0_IACF12_Msk
#define IAC_ICR0_IACF13_Pos           (13U)
#define IAC_ICR0_IACF13_Msk           (0x1UL << IAC_ICR0_IACF13_Pos)              /*!< 0x00002000 */
#define IAC_ICR0_IACF13               IAC_ICR0_IACF13_Msk
#define IAC_ICR0_IACF14_Pos           (14U)
#define IAC_ICR0_IACF14_Msk           (0x1UL << IAC_ICR0_IACF14_Pos)              /*!< 0x00004000 */
#define IAC_ICR0_IACF14               IAC_ICR0_IACF14_Msk
#define IAC_ICR0_IACF15_Pos           (15U)
#define IAC_ICR0_IACF15_Msk           (0x1UL << IAC_ICR0_IACF15_Pos)              /*!< 0x00008000 */
#define IAC_ICR0_IACF15               IAC_ICR0_IACF15_Msk
#define IAC_ICR0_IACF16_Pos           (16U)
#define IAC_ICR0_IACF16_Msk           (0x1UL << IAC_ICR0_IACF16_Pos)              /*!< 0x00010000 */
#define IAC_ICR0_IACF16               IAC_ICR0_IACF16_Msk
#define IAC_ICR0_IACF17_Pos           (17U)
#define IAC_ICR0_IACF17_Msk           (0x1UL << IAC_ICR0_IACF17_Pos)              /*!< 0x00020000 */
#define IAC_ICR0_IACF17               IAC_ICR0_IACF17_Msk
#define IAC_ICR0_IACF18_Pos           (18U)
#define IAC_ICR0_IACF18_Msk           (0x1UL << IAC_ICR0_IACF18_Pos)              /*!< 0x00040000 */
#define IAC_ICR0_IACF18               IAC_ICR0_IACF18_Msk
#define IAC_ICR0_IACF19_Pos           (19U)
#define IAC_ICR0_IACF19_Msk           (0x1UL << IAC_ICR0_IACF19_Pos)              /*!< 0x00080000 */
#define IAC_ICR0_IACF19               IAC_ICR0_IACF19_Msk
#define IAC_ICR0_IACF20_Pos           (20U)
#define IAC_ICR0_IACF20_Msk           (0x1UL << IAC_ICR0_IACF20_Pos)              /*!< 0x00100000 */
#define IAC_ICR0_IACF20               IAC_ICR0_IACF20_Msk
#define IAC_ICR0_IACF21_Pos           (21U)
#define IAC_ICR0_IACF21_Msk           (0x1UL << IAC_ICR0_IACF21_Pos)              /*!< 0x00200000 */
#define IAC_ICR0_IACF21               IAC_ICR0_IACF21_Msk
#define IAC_ICR0_IACF22_Pos           (22U)
#define IAC_ICR0_IACF22_Msk           (0x1UL << IAC_ICR0_IACF22_Pos)              /*!< 0x00400000 */
#define IAC_ICR0_IACF22               IAC_ICR0_IACF22_Msk
#define IAC_ICR0_IACF23_Pos           (23U)
#define IAC_ICR0_IACF23_Msk           (0x1UL << IAC_ICR0_IACF23_Pos)              /*!< 0x00800000 */
#define IAC_ICR0_IACF23               IAC_ICR0_IACF23_Msk
#define IAC_ICR0_IACF24_Pos           (24U)
#define IAC_ICR0_IACF24_Msk           (0x1UL << IAC_ICR0_IACF24_Pos)              /*!< 0x01000000 */
#define IAC_ICR0_IACF24               IAC_ICR0_IACF24_Msk
#define IAC_ICR0_IACF25_Pos           (25U)
#define IAC_ICR0_IACF25_Msk           (0x1UL << IAC_ICR0_IACF25_Pos)              /*!< 0x02000000 */
#define IAC_ICR0_IACF25               IAC_ICR0_IACF25_Msk
#define IAC_ICR0_IACF26_Pos           (26U)
#define IAC_ICR0_IACF26_Msk           (0x1UL << IAC_ICR0_IACF26_Pos)              /*!< 0x04000000 */
#define IAC_ICR0_IACF26               IAC_ICR0_IACF26_Msk
#define IAC_ICR0_IACF27_Pos           (27U)
#define IAC_ICR0_IACF27_Msk           (0x1UL << IAC_ICR0_IACF27_Pos)              /*!< 0x08000000 */
#define IAC_ICR0_IACF27               IAC_ICR0_IACF27_Msk
#define IAC_ICR0_IACF28_Pos           (28U)
#define IAC_ICR0_IACF28_Msk           (0x1UL << IAC_ICR0_IACF28_Pos)              /*!< 0x10000000 */
#define IAC_ICR0_IACF28               IAC_ICR0_IACF28_Msk
#define IAC_ICR0_IACF29_Pos           (29U)
#define IAC_ICR0_IACF29_Msk           (0x1UL << IAC_ICR0_IACF29_Pos)              /*!< 0x20000000 */
#define IAC_ICR0_IACF29               IAC_ICR0_IACF29_Msk
#define IAC_ICR0_IACF30_Pos           (30U)
#define IAC_ICR0_IACF30_Msk           (0x1UL << IAC_ICR0_IACF30_Pos)              /*!< 0x40000000 */
#define IAC_ICR0_IACF30               IAC_ICR0_IACF30_Msk
#define IAC_ICR0_IACF31_Pos           (31U)
#define IAC_ICR0_IACF31_Msk           (0x1UL << IAC_ICR0_IACF31_Pos)              /*!< 0x80000000 */
#define IAC_ICR0_IACF31               IAC_ICR0_IACF31_Msk

