micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n657xx.h
/*******************  Bits definition for SAES_KEYR1 register  ******************/
#define SAES_KEYR1_Pos                       (0U)
#define SAES_KEYR1_Msk                       (0xFFFFFFFFUL << SAES_KEYR1_Pos)         /*!< 0xFFFFFFFF */
#define SAES_KEYR1                           SAES_KEYR1_Msk                           /*!< SAES cryptographic key, bits [63:32] */

/*******************  Bits definition for SAES_KEYR2 register  ******************/
#define SAES_KEYR2_Pos                       (0U)
#define SAES_KEYR2_Msk                       (0xFFFFFFFFUL << SAES_KEYR2_Pos)         /*!< 0xFFFFFFFF */
#define SAES_KEYR2                           SAES_KEYR2_Msk                           /*!< SAES cryptographic key, bits [95:64] */

/*******************  Bits definition for SAES_KEYR3 register  ******************/
#define SAES_KEYR3_Pos                       (0U)
#define SAES_KEYR3_Msk                       (0xFFFFFFFFUL << SAES_KEYR3_Pos)         /*!< 0xFFFFFFFF */
#define SAES_KEYR3                           SAES_KEYR3_Msk                           /*!< SAES cryptographic key, bits [127:96] */

/*******************  Bits definition for SAES_KEYR4 register  ******************/
#define SAES_KEYR4_Pos                       (0U)
#define SAES_KEYR4_Msk                       (0xFFFFFFFFUL << SAES_KEYR4_Pos)         /*!< 0xFFFFFFFF */
#define SAES_KEYR4                           SAES_KEYR4_Msk                           /*!< SAES cryptographic key, bits [127:96] */

/*******************  Bits definition for SAES_KEYR5 register  ******************/
#define SAES_KEYR5_Pos                       (0U)
#define SAES_KEYR5_Msk                       (0xFFFFFFFFUL << SAES_KEYR5_Pos)         /*!< 0xFFFFFFFF */
#define SAES_KEYR5                           SAES_KEYR5_Msk                           /*!< SAES cryptographic key, bits [127:96] */

/*******************  Bits definition for SAES_KEYR6 register  ******************/
#define SAES_KEYR6_Pos                       (0U)
#define SAES_KEYR6_Msk                       (0xFFFFFFFFUL << SAES_KEYR6_Pos)         /*!< 0xFFFFFFFF */
#define SAES_KEYR6                           SAES_KEYR6_Msk                           /*!< SAES cryptographic key, bits [127:96] */

/*******************  Bits definition for SAES_KEYR7 register  ******************/
#define SAES_KEYR7_Pos                       (0U)
#define SAES_KEYR7_Msk                       (0xFFFFFFFFUL << SAES_KEYR7_Pos)         /*!< 0xFFFFFFFF */
#define SAES_KEYR7                           SAES_KEYR7_Msk                           /*!< SAES cryptographic key, bits [127:96] */

/*******************  Bits definition for SAES_IVR0 register   ******************/
#define SAES_IVR0_Pos                        (0U)
#define SAES_IVR0_Msk                        (0xFFFFFFFFUL << SAES_IVR0_Pos)          /*!< 0xFFFFFFFF */
#define SAES_IVR0                            SAES_IVR0_Msk                            /*!< SAES initialization vector input, bits [31:0] */

/*******************  Bits definition for SAES_IVR1 register   ******************/
#define SAES_IVR1_Pos                        (0U)
#define SAES_IVR1_Msk                        (0xFFFFFFFFUL << SAES_IVR1_Pos)          /*!< 0xFFFFFFFF */
#define SAES_IVR1                            SAES_IVR1_Msk                            /*!< SAES initialization vector input, bits [63:32] */

/*******************  Bits definition for SAES_IVR2 register   ******************/
#define SAES_IVR2_Pos                        (0U)
#define SAES_IVR2_Msk                        (0xFFFFFFFFUL << SAES_IVR2_Pos)          /*!< 0xFFFFFFFF */
#define SAES_IVR2                            SAES_IVR2_Msk                            /*!< SAES initialization vector input, bits [95:64] */

/*******************  Bits definition for SAES_IVR3 register   ******************/
#define SAES_IVR3_Pos                        (0U)
#define SAES_IVR3_Msk                        (0xFFFFFFFFUL << SAES_IVR3_Pos)          /*!< 0xFFFFFFFF */
#define SAES_IVR3                            SAES_IVR3_Msk                            /*!< SAES initialization vector input, bits [127:96] */

/*******************  Bits definition for SAES_DPACFGR register     ******************/
#define SAES_DPACFGR_REDCFG_Pos              (0U)
#define SAES_DPACFGR_REDCFG_Msk              (0x3UL << SAES_DPACFGR_REDCFG_Pos)       /*!< 0x00000003 */
#define SAES_DPACFGR_REDCFG                  SAES_DPACFGR_REDCFG_Msk                  /*!< Redundancy configuration*/
#define SAES_DPACFGR_REDCFG_0                (0x1UL << SAES_DPACFGR_REDCFG_Pos)       /*!< 0x00000001 */
#define SAES_DPACFGR_REDCFG_1                (0x2UL << SAES_DPACFGR_REDCFG_Pos)       /*!< 0x00000002 */
#define SAES_DPACFGR_RESEED_Pos              (2U)
#define SAES_DPACFGR_RESEED_Msk              (0x1UL << SAES_DPACFGR_RESEED_Pos)       /*!< 0x00000004 */
#define SAES_DPACFGR_RESEED                  SAES_DPACFGR_RESEED_Msk                  /*!< Automatic reseed enable */
#define SAES_DPACFGR_TRIMCFG_Pos             (3U)
#define SAES_DPACFGR_TRIMCFG_Msk             (0x3UL << SAES_DPACFGR_TRIMCFG_Pos)      /*!< 0x00000018 */
#define SAES_DPACFGR_TRIMCFG                 SAES_DPACFGR_TRIMCFG_Msk                 /*!< Clock trimming */
#define SAES_DPACFGR_TRIMCFG_0               (0x1UL << SAES_DPACFGR_TRIMCFG_Pos)      /*!< 0x00000008 */
#define SAES_DPACFGR_TRIMCFG_1               (0x2UL << SAES_DPACFGR_TRIMCFG_Pos)      /*!< 0x00000010 */
#define SAES_DPACFGR_CONFIGLOCK_Pos          (31U)
#define SAES_DPACFGR_CONFIGLOCK_Msk          (0x1UL << SAES_DPACFGR_CONFIGLOCK_Pos)   /*!< 0x80000000 */
#define SAES_DPACFGR_CONFIGLOCK               SAES_DPACFGR_CONFIGLOCK_Msk             /*!< DPA configuration lock */

/*******************  Bits definition for SAES_IER register     ******************/
#define SAES_IER_CCFIE_Pos                   (0U)
#define SAES_IER_CCFIE_Msk                   (0x1UL << SAES_IER_CCFIE_Pos)            /*!< 0x00000001 */
#define SAES_IER_CCFIE                       SAES_IER_CCFIE_Msk                       /*!< Computation complete flag interrupt enable */
#define SAES_IER_RWEIE_Pos                   (1U)
#define SAES_IER_RWEIE_Msk                   (0x1UL << SAES_IER_RWEIE_Pos)            /*!< 0x00000002 */
#define SAES_IER_RWEIE                       SAES_IER_RWEIE_Msk                       /*!< Read or write error Interrupt Enable */
#define SAES_IER_KEIE_Pos                    (2U)
#define SAES_IER_KEIE_Msk                    (0x1UL << SAES_IER_KEIE_Pos)             /*!< 0x00000004 */
#define SAES_IER_KEIE                        SAES_IER_KEIE_Msk                        /*!< Key error interrupt enable */
#define SAES_IER_RNGEIE_Pos                  (3U)
#define SAES_IER_RNGEIE_Msk                  (0x1UL << SAES_IER_RNGEIE_Pos)           /*!< 0x00000008 */
#define SAES_IER_RNGEIE                      SAES_IER_RNGEIE_Msk                      /*!< RNG error interrupt enable */

