micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n657xx.h
/********************* USART Instances : Smard card mode *********************/
#define IS_SMARTCARD_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS)  || \
                                         ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS)  || \
                                         ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS)  || \
                                         ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS)  || \
                                         ((INSTANCE) == USART10_S) || ((INSTANCE) == USART10_NS))

/******************** LPUART Instance ****************************************/
#define IS_LPUART_INSTANCE(INSTANCE) (((INSTANCE) == LPUART1_S) || ((INSTANCE) == LPUART1_NS))

/****************** LPTIM Instances : All supported instances *****************/
#define IS_LPTIM_INSTANCE(INSTANCE)     (((INSTANCE) == LPTIM1_S) || ((INSTANCE) == LPTIM1_NS) || \
                                         ((INSTANCE) == LPTIM2_S) || ((INSTANCE) == LPTIM2_NS) || \
                                         ((INSTANCE) == LPTIM3_S) || ((INSTANCE) == LPTIM3_NS) || \
                                         ((INSTANCE) == LPTIM4_S) || ((INSTANCE) == LPTIM4_NS) || \
                                         ((INSTANCE) == LPTIM5_S) || ((INSTANCE) == LPTIM5_NS))

/****************** LPTIM Instances : DMA supported instances *****************/
#define IS_LPTIM_DMA_INSTANCE(INSTANCE) (((INSTANCE) == LPTIM1_S) || ((INSTANCE) == LPTIM1_NS) || \
                                         ((INSTANCE) == LPTIM2_S) || ((INSTANCE) == LPTIM2_NS) || \
                                         ((INSTANCE) == LPTIM3_S) || ((INSTANCE) == LPTIM3_NS))

/************* LPTIM Instances : at least 1 capture/compare channel ***********/
#define IS_LPTIM_CC1_INSTANCE(INSTANCE) (((INSTANCE) == LPTIM1_S) || ((INSTANCE) == LPTIM1_NS) || \
                                         ((INSTANCE) == LPTIM2_S) || ((INSTANCE) == LPTIM2_NS) || \
                                         ((INSTANCE) == LPTIM3_S) || ((INSTANCE) == LPTIM3_NS) || \
                                         ((INSTANCE) == LPTIM4_S) || ((INSTANCE) == LPTIM4_NS) || \
                                         ((INSTANCE) == LPTIM5_S) || ((INSTANCE) == LPTIM5_NS))

/************* LPTIM Instances : at least 2 capture/compare channel ***********/
#define IS_LPTIM_CC2_INSTANCE(INSTANCE) (((INSTANCE) == LPTIM1_S) || ((INSTANCE) == LPTIM1_NS) || \
                                         ((INSTANCE) == LPTIM2_S) || ((INSTANCE) == LPTIM2_NS) || \
                                         ((INSTANCE) == LPTIM3_S) || ((INSTANCE) == LPTIM3_NS))

/****************** LPTIM Instances : supporting encoder interface **************/
#define IS_LPTIM_ENCODER_INTERFACE_INSTANCE(INSTANCE) (((INSTANCE) == LPTIM1_S) || ((INSTANCE) == LPTIM1_NS) || \
                                                       ((INSTANCE) == LPTIM2_S) || ((INSTANCE) == LPTIM2_NS) || \
                                                       ((INSTANCE) == LPTIM3_S) || ((INSTANCE) == LPTIM3_NS))


/****************** LPTIM Instances : supporting Input Capture **************/
#define IS_LPTIM_INPUT_CAPTURE_INSTANCE(INSTANCE) (((INSTANCE) == LPTIM1_S) || ((INSTANCE) == LPTIM1_NS) || \
                                                   ((INSTANCE) == LPTIM2_S) || ((INSTANCE) == LPTIM2_NS) || \
                                                   ((INSTANCE) == LPTIM3_S) || ((INSTANCE) == LPTIM3_NS))

/****************** TIM Instances : All supported instances *******************/
#define IS_TIM_INSTANCE(INSTANCE)       (((INSTANCE) == TIM1_S)   || ((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_S)   || ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_S)   || ((INSTANCE) == TIM3_NS)  || \
                                         ((INSTANCE) == TIM4_S)   || ((INSTANCE) == TIM4_NS)  || \
                                         ((INSTANCE) == TIM5_S)   || ((INSTANCE) == TIM5_NS)  || \
                                         ((INSTANCE) == TIM6_S)   || ((INSTANCE) == TIM6_NS)  || \
                                         ((INSTANCE) == TIM7_S)   || ((INSTANCE) == TIM7_NS)  || \
                                         ((INSTANCE) == TIM8_S)   || ((INSTANCE) == TIM8_NS)  || \
                                         ((INSTANCE) == TIM9_S)   || ((INSTANCE) == TIM9_NS)  || \
                                         ((INSTANCE) == TIM10_S)  || ((INSTANCE) == TIM10_NS) || \
                                         ((INSTANCE) == TIM11_S)  || ((INSTANCE) == TIM11_NS) || \
                                         ((INSTANCE) == TIM12_S)  || ((INSTANCE) == TIM12_NS) || \
                                         ((INSTANCE) == TIM13_S)  || ((INSTANCE) == TIM13_NS) || \
                                         ((INSTANCE) == TIM14_S)  || ((INSTANCE) == TIM14_NS) || \
                                         ((INSTANCE) == TIM15_S)  || ((INSTANCE) == TIM15_NS) || \
                                         ((INSTANCE) == TIM16_S)  || ((INSTANCE) == TIM16_NS) || \
                                         ((INSTANCE) == TIM17_S)  || ((INSTANCE) == TIM17_NS) || \
                                         ((INSTANCE) == TIM18_S)  || ((INSTANCE) == TIM18_NS))

/****************** TIM Instances : supporting 32 bits counter ****************/
#define IS_TIM_32B_COUNTER_INSTANCE(INSTANCE) (((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS) || \
                                               ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS) || \
                                               ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS) || \
                                               ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS))

/****************** TIM Instances : supporting the break function *************/
#define IS_TIM_BREAK_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                            ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS)  || \
                                            ((INSTANCE) == TIM15_S) || ((INSTANCE) == TIM15_NS) || \
                                            ((INSTANCE) == TIM16_S) || ((INSTANCE) == TIM16_NS) || \
                                            ((INSTANCE) == TIM17_S) || ((INSTANCE) == TIM17_NS))

