micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n657xx.h
/************** TIM Instances : supporting Break source selection *************/
#define IS_TIM_BREAKSOURCE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                               ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS)  || \
                                               ((INSTANCE) == TIM15_S) || ((INSTANCE) == TIM15_NS) || \
                                               ((INSTANCE) == TIM16_S) || ((INSTANCE) == TIM16_NS) || \
                                               ((INSTANCE) == TIM17_S) || ((INSTANCE) == TIM17_NS))

/****************** TIM Instances : supporting 2 break inputs *****************/
#define IS_TIM_BKIN2_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_S) || ((INSTANCE) == TIM1_NS) || \
                                            ((INSTANCE) == TIM8_S) || ((INSTANCE) == TIM8_NS))

/************* TIM Instances : at least 1 capture/compare channel *************/
#define IS_TIM_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_S)   || ((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_S)   || ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_S)   || ((INSTANCE) == TIM3_NS)  || \
                                         ((INSTANCE) == TIM4_S)   || ((INSTANCE) == TIM4_NS)  || \
                                         ((INSTANCE) == TIM5_S)   || ((INSTANCE) == TIM5_NS)  || \
                                         ((INSTANCE) == TIM8_S)   || ((INSTANCE) == TIM8_NS)  || \
                                         ((INSTANCE) == TIM9_S)   || ((INSTANCE) == TIM9_NS)  || \
                                         ((INSTANCE) == TIM10_S)  || ((INSTANCE) == TIM10_NS) || \
                                         ((INSTANCE) == TIM11_S)  || ((INSTANCE) == TIM11_NS) || \
                                         ((INSTANCE) == TIM12_S)  || ((INSTANCE) == TIM12_NS) || \
                                         ((INSTANCE) == TIM13_S)  || ((INSTANCE) == TIM13_NS) || \
                                         ((INSTANCE) == TIM14_S)  || ((INSTANCE) == TIM14_NS) || \
                                         ((INSTANCE) == TIM15_S)  || ((INSTANCE) == TIM15_NS) || \
                                         ((INSTANCE) == TIM16_S)  || ((INSTANCE) == TIM16_NS) || \
                                         ((INSTANCE) == TIM17_S)  || ((INSTANCE) == TIM17_NS))

/************ TIM Instances : at least 2 capture/compare channels *************/
#define IS_TIM_CC2_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                         ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS)  || \
                                         ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                         ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS)  || \
                                         ((INSTANCE) == TIM9_S)  || ((INSTANCE) == TIM9_NS)  || \
                                         ((INSTANCE) == TIM12_S) || ((INSTANCE) == TIM12_NS) || \
                                         ((INSTANCE) == TIM15_S) || ((INSTANCE) == TIM15_NS))

/************ TIM Instances : at least 3 capture/compare channels *************/
#define IS_TIM_CC3_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS) || \
                                         ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS) || \
                                         ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS) || \
                                         ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS) || \
                                         ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS) || \
                                         ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))

/************ TIM Instances : at least 4 capture/compare channels *************/
#define IS_TIM_CC4_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS) || \
                                         ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS) || \
                                         ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS) || \
                                         ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS) || \
                                         ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS) || \
                                         ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))

/****************** TIM Instances : at least 5 capture/compare channels *******/
#define IS_TIM_CC5_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS) || \
                                         ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))

/****************** TIM Instances : at least 6 capture/compare channels *******/
#define IS_TIM_CC6_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS) || \
                                        ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))

/****************** TIM Instances : DMA requests generation (TIMx_DIER.UDE) ***/
#define IS_TIM_DMA_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_S)   || ((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_S)   || ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_S)   || ((INSTANCE) == TIM3_NS)  || \
                                         ((INSTANCE) == TIM4_S)   || ((INSTANCE) == TIM4_NS)  || \
                                         ((INSTANCE) == TIM5_S)   || ((INSTANCE) == TIM5_NS)  || \
                                         ((INSTANCE) == TIM6_S)   || ((INSTANCE) == TIM6_NS)  || \
                                         ((INSTANCE) == TIM7_S)   || ((INSTANCE) == TIM7_NS)  || \
                                         ((INSTANCE) == TIM8_S)   || ((INSTANCE) == TIM8_NS)  || \
                                         ((INSTANCE) == TIM15_S)  || ((INSTANCE) == TIM15_NS) || \
                                         ((INSTANCE) == TIM16_S)  || ((INSTANCE) == TIM16_NS) || \
                                         ((INSTANCE) == TIM17_S)  || ((INSTANCE) == TIM17_NS))

/************ TIM Instances : DMA requests generation (TIMx_DIER.CCxDE) *******/
#define IS_TIM_DMA_CC_INSTANCE(INSTANCE) (((INSTANCE) == TIM1_S)   || ((INSTANCE) == TIM1_NS)  || \
                                          ((INSTANCE) == TIM2_S)   || ((INSTANCE) == TIM2_NS)  || \
                                          ((INSTANCE) == TIM3_S)   || ((INSTANCE) == TIM3_NS)  || \
                                          ((INSTANCE) == TIM4_S)   || ((INSTANCE) == TIM4_NS)  || \
                                          ((INSTANCE) == TIM5_S)   || ((INSTANCE) == TIM5_NS)  || \
                                          ((INSTANCE) == TIM8_S)   || ((INSTANCE) == TIM8_NS)  || \
                                          ((INSTANCE) == TIM15_S)  || ((INSTANCE) == TIM15_NS) || \
                                          ((INSTANCE) == TIM16_S)  || ((INSTANCE) == TIM16_NS) || \
                                          ((INSTANCE) == TIM17_S)  || ((INSTANCE) == TIM17_NS))

/******************** TIM Instances : DMA burst feature ***********************/
#define IS_TIM_DMABURST_INSTANCE(INSTANCE) (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                            ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                            ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                            ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS)  || \
                                            ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                            ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS)  || \
                                            ((INSTANCE) == TIM15_S) || ((INSTANCE) == TIM15_NS) || \
                                            ((INSTANCE) == TIM16_S) || ((INSTANCE) == TIM16_NS) || \
                                            ((INSTANCE) == TIM17_S) || ((INSTANCE) == TIM17_NS))

/******************* TIM Instances : output(s) available **********************/
#define IS_TIM_CCX_INSTANCE(INSTANCE, CHANNEL) \
    (((((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS))  &&   \
     (((CHANNEL) == TIM_CHANNEL_1) ||                            \
      ((CHANNEL) == TIM_CHANNEL_2) ||                            \
      ((CHANNEL) == TIM_CHANNEL_3) ||                            \
      ((CHANNEL) == TIM_CHANNEL_4) ||                            \
      ((CHANNEL) == TIM_CHANNEL_5) ||                            \
      ((CHANNEL) == TIM_CHANNEL_6)))                             \
     ||                                                          \
     ((((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS))  &&   \
     (((CHANNEL) == TIM_CHANNEL_1) ||                            \
      ((CHANNEL) == TIM_CHANNEL_2) ||                            \
      ((CHANNEL) == TIM_CHANNEL_3) ||                            \
      ((CHANNEL) == TIM_CHANNEL_4)))                             \
     ||                                                          \
     ((((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS))  &&   \
     (((CHANNEL) == TIM_CHANNEL_1) ||                            \
      ((CHANNEL) == TIM_CHANNEL_2) ||                            \
      ((CHANNEL) == TIM_CHANNEL_3) ||                            \
      ((CHANNEL) == TIM_CHANNEL_4)))                             \
     ||                                                          \
     ((((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS))  &&   \
     (((CHANNEL) == TIM_CHANNEL_1) ||                            \
      ((CHANNEL) == TIM_CHANNEL_2) ||                            \
      ((CHANNEL) == TIM_CHANNEL_3) ||                            \
      ((CHANNEL) == TIM_CHANNEL_4)))                             \
     ||                                                          \
     ((((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS))  &&   \
     (((CHANNEL) == TIM_CHANNEL_1) ||                            \
      ((CHANNEL) == TIM_CHANNEL_2) ||                            \
      ((CHANNEL) == TIM_CHANNEL_3) ||                            \
      ((CHANNEL) == TIM_CHANNEL_4)))                             \
     ||                                                          \
     ((((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))  &&   \
     (((CHANNEL) == TIM_CHANNEL_1) ||                            \
      ((CHANNEL) == TIM_CHANNEL_2) ||                            \
      ((CHANNEL) == TIM_CHANNEL_3) ||                            \
      ((CHANNEL) == TIM_CHANNEL_4) ||                            \
      ((CHANNEL) == TIM_CHANNEL_5) ||                            \
      ((CHANNEL) == TIM_CHANNEL_6)))                             \
     ||                                                          \
     ((((INSTANCE) == TIM9_S)  || ((INSTANCE) == TIM9_NS))  &&   \
     (((CHANNEL) == TIM_CHANNEL_1) ||                            \
      ((CHANNEL) == TIM_CHANNEL_2)))                             \
     ||                                                          \
     ((((INSTANCE) == TIM10_S)  || ((INSTANCE) == TIM10_NS))  && \
     (((CHANNEL) == TIM_CHANNEL_1)))                             \
     ||                                                          \
     ((((INSTANCE) == TIM11_S)  || ((INSTANCE) == TIM11_NS))  && \
     (((CHANNEL) == TIM_CHANNEL_1)))                             \
     ||                                                          \
     ((((INSTANCE) == TIM12_S)  || ((INSTANCE) == TIM12_NS))  && \
     (((CHANNEL) == TIM_CHANNEL_1) ||                            \
      ((CHANNEL) == TIM_CHANNEL_2)))                             \
     ||                                                          \
     ((((INSTANCE) == TIM13_S)  || ((INSTANCE) == TIM13_NS))  && \
     (((CHANNEL) == TIM_CHANNEL_1)))                             \
     ||                                                          \
     ((((INSTANCE) == TIM14_S)  || ((INSTANCE) == TIM14_NS))  && \
     (((CHANNEL) == TIM_CHANNEL_1)))                             \
     ||                                                          \
     (((INSTANCE) == TIM15_S)   &&                               \
     (((CHANNEL) == TIM_CHANNEL_1) ||                            \
      ((CHANNEL) == TIM_CHANNEL_2)))                             \
     ||                                                          \
     ((((INSTANCE) == TIM16_S)  || ((INSTANCE) == TIM16_NS))  && \
     (((CHANNEL) == TIM_CHANNEL_1)))                             \
     ||                                                          \
     ((((INSTANCE) == TIM17_S)  || ((INSTANCE) == TIM17_NS))  && \
     (((CHANNEL) == TIM_CHANNEL_1))))

/****************** TIM Instances : supporting complementary output(s) ********/
#define IS_TIM_CCXN_INSTANCE(INSTANCE, CHANNEL)                  \
    (((((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS))  &&   \
     (((CHANNEL) == TIM_CHANNEL_1) ||                            \
      ((CHANNEL) == TIM_CHANNEL_2) ||                            \
      ((CHANNEL) == TIM_CHANNEL_3) ||                            \
      ((CHANNEL) == TIM_CHANNEL_4)))                             \
     ||                                                          \
     ((((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))  &&   \
     (((CHANNEL) == TIM_CHANNEL_1) ||                            \
      ((CHANNEL) == TIM_CHANNEL_2) ||                            \
      ((CHANNEL) == TIM_CHANNEL_3) ||                            \
      ((CHANNEL) == TIM_CHANNEL_4)))                             \
     ||                                                          \
     ((((INSTANCE) == TIM15_S)  || ((INSTANCE) == TIM15_NS))  && \
     ((CHANNEL) == TIM_CHANNEL_1))                               \
     ||                                                          \
     ((((INSTANCE) == TIM16_S)  || ((INSTANCE) == TIM16_NS))  && \
     ((CHANNEL) == TIM_CHANNEL_1))                               \
     ||                                                          \
     ((((INSTANCE) == TIM17_S)  || ((INSTANCE) == TIM17_NS))  && \
     ((CHANNEL) == TIM_CHANNEL_1)))

