micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n657xx.h
/**************************** GPIO Lock Instances ****************************/
/* All GPIO Banks support the Lock mechanism */
#define IS_GPIO_LOCK_INSTANCE(INSTANCE) IS_GPIO_ALL_INSTANCE(INSTANCE)

/******************************* GPU2D Instances *****************************/
#define IS_GPU2D_ALL_INSTANCE(INSTANCE) ((INSTANCE) == GPU2D_BASE_NS)

/******************************** I2C Instances ******************************/
#define IS_I2C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_NS) || \
                                       ((INSTANCE) == I2C2_NS) || \
                                       ((INSTANCE) == I2C3_NS) || \
                                       ((INSTANCE) == I2C4_NS))

/****************** I2C Instances : wakeup capability from stop modes ********/
#define IS_I2C_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) IS_I2C_ALL_INSTANCE(INSTANCE)

/******************************** I3C Instances *******************************/
#define IS_I3C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I3C1_NS) || \
                                      ((INSTANCE) == I3C2_NS))

/****************************** IWDG Instances *******************************/
#define IS_IWDG_ALL_INSTANCE(INSTANCE) ((INSTANCE) == IWDG_NS)

/******************************* JPEG Instances ******************************/
#define IS_JPEG_ALL_INSTANCE(INSTANCE) ((INSTANCE) == JPEG_NS)

/****************************** LTDC Instances *******************************/
#define IS_LTDC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == LTDC_NS)

/******************************* MCE Instances *******************************/
#define IS_MCE_ALL_INSTANCE(INSTANCE) (((INSTANCE) == MCE1_NS) || \
                                       ((INSTANCE) == MCE2_NS) || \
                                       ((INSTANCE) == MCE3_NS) || \
                                       ((INSTANCE) == MCE4_NS))

/******************************* MDF/ADF Instances ***************************/
#define IS_MDF_ALL_INSTANCE(INSTANCE) (((INSTANCE) == MDF1_Filter0_NS) || \
                                       ((INSTANCE) == MDF1_Filter1_NS) || \
                                       ((INSTANCE) == MDF1_Filter2_NS) || \
                                       ((INSTANCE) == MDF1_Filter3_NS) || \
                                       ((INSTANCE) == MDF1_Filter4_NS) || \
                                       ((INSTANCE) == MDF1_Filter5_NS) || \
                                       ((INSTANCE) == ADF1_Filter0_NS))

/****************************** MDIOS Instances ******************************/
#define IS_MDIOS_ALL_INSTANCE(INSTANCE) ((INSTANCE) == MDIOS_NS)

/******************************* PKA Instances *******************************/
#define IS_PKA_ALL_INSTANCE(INSTANCE) ((INSTANCE) == PKA_NS)

/******************************* PSSI Instances ******************************/
#define IS_PSSI_ALL_INSTANCE(INSTANCE) ((INSTANCE) == PSSI_NS)

/****************************** RAMCFG Instances ********************************/
#define IS_RAMCFG_ALL_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_SRAM1_AHB_NS) || \
                                          ((INSTANCE) == RAMCFG_SRAM2_AHB_NS) || \
                                          ((INSTANCE) == RAMCFG_SRAM1_AXI_NS) || \
                                          ((INSTANCE) == RAMCFG_SRAM2_AXI_NS) || \
                                          ((INSTANCE) == RAMCFG_SRAM3_AXI_NS) || \
                                          ((INSTANCE) == RAMCFG_SRAM4_AXI_NS) || \
                                          ((INSTANCE) == RAMCFG_SRAM5_AXI_NS) || \
                                          ((INSTANCE) == RAMCFG_SRAM6_AXI_NS) || \
                                          ((INSTANCE) == RAMCFG_BKPSRAM_NS)   || \
                                          ((INSTANCE) == RAMCFG_FLEXRAM_NS)   || \
                                          ((INSTANCE) == RAMCFG_VENC_RAM_NS))

/***************************** RAMCFG ECC Instances *****************************/
#define IS_RAMCFG_ECC_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_BKPSRAM_NS) || \
                                          ((INSTANCE) == RAMCFG_FLEXRAM_NS))

/***************************** RAMCFG AXISRAM POWERDOWN Instances ***************/
#define IS_RAMCFG_AXISRAM_POWERDOWN_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_SRAM2_AXI_NS) || \
                                                        ((INSTANCE) == RAMCFG_SRAM3_AXI_NS) || \
                                                        ((INSTANCE) == RAMCFG_SRAM4_AXI_NS) || \
                                                        ((INSTANCE) == RAMCFG_SRAM5_AXI_NS) || \
                                                        ((INSTANCE) == RAMCFG_SRAM6_AXI_NS))

/******************************* RNG Instances *******************************/
#define IS_RNG_ALL_INSTANCE(INSTANCE) ((INSTANCE) == RNG_NS)

/******************************* RTC Instances *******************************/
#define IS_RTC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == RTC_NS)

/******************************** SAI Instances ******************************/
#define IS_SAI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SAI1_Block_A_NS) || \
                                       ((INSTANCE) == SAI1_Block_B_NS) || \
                                       ((INSTANCE) == SAI2_Block_A_NS) || \
                                       ((INSTANCE) == SAI2_Block_B_NS))

/******************************* SDMMC Instances *****************************/
#define IS_SDMMC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SDMMC1_NS) || \
                                         ((INSTANCE) == SDMMC2_NS))

/******************************** SMBUS Instances ****************************/
#define IS_SMBUS_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_NS) || \
                                         ((INSTANCE) == I2C2_NS) || \
                                         ((INSTANCE) == I2C3_NS) || \
                                         ((INSTANCE) == I2C4_NS))

/****************************** SPDIFRX Instances ****************************/
#define IS_SPDIFRX_ALL_INSTANCE(INSTANCE) ((INSTANCE) == SPDIFRX_NS)

/******************************** SPI Instances ******************************/
#define IS_SPI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1_NS) || \
                                       ((INSTANCE) == SPI2_NS) || \
                                       ((INSTANCE) == SPI3_NS) || \
                                       ((INSTANCE) == SPI4_NS) || \
                                       ((INSTANCE) == SPI5_NS) || \
                                       ((INSTANCE) == SPI6_NS))

#define IS_SPI_FULL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1_NS) || \
                                        ((INSTANCE) == SPI2_NS) || \
                                        ((INSTANCE) == SPI3_NS) || \
                                        ((INSTANCE) == SPI6_NS))

